package lesson7.homework;

public class Task2 {
    /**
     *
     * Даны четыре действительных числа: x1, y1, x2, y2. Напишите функцию distance(x1, y1, x2, y2),
     * вычисляющую расстояние между точкой (x1. y1) и (x2, y2).
     * Считайте четыре действительных числа и выведите результат работы этой функции.
     *
     * Формат входных данных
     * Вводятся четыре действительных числа.
     *
     * Формат выходных данных
     * Выведите ответ на задачу.
     */
    public static void main(String[] args) {
        // ...
    }
}
