package lesson7.homework;

public class Task3 {

    /**
     * Даны пять действительных чисел: x, y, xc, yc, r. Проверьте, принадлежит ли точка (x, y) кругу с центром (xc, yc) и радиусом r. Если точка принадлежит кругу, выведите слово YES, иначе выведите слово NO.
     * Решение должно содержать функцию IsPointInCircle(x, y, xc, yc, r), возвращающую True, если точка принадлежит кругу и False, если не принадлежит. Основная программа должна считать координаты точки, вызвать функцию IsPointInCircle и в зависимости от возвращенного значения вывести на экран необходимое сообщение.
     * Функция IsPointInCircle не должна содержать инструкцию if.
     *
     * Формат входных данных
     * Вводятся пять действительных чисел.
     *
     * Формат выходных данных
     * Выведите ответ на задачу.
     */
    public static void main(String[] args) {
        //...
    }
}
